.config/emacs/config.org
#+title: Damian's Emacs Config
#+author: Damian Suarez
#+property: header-args :results value silent

* Table of contents :toc:
- [[#packages-managed-by-debian][Packages managed by debian]]
- [[#priorities][Priorities]]
  - [[#melpa][Melpa]]
  - [[#completion][Completion]]
- [[#configs][Configs]]
  - [[#autopairs][Autopairs]]
  - [[#fonts][Fonts]]
  - [[#files][Files]]
  - [[#gui][GUI]]
  - [[#org-mode][Org mode]]
  - [[#reload-emacs][Reload emacs]]
- [[#packages][Packages]]
  - [[#all-the-icons][All the icons]]
  - [[#apheleia][Apheleia]]
  - [[#avy][Avy]]
  - [[#corfu][Corfu]]
  - [[#eshell][Eshell]]
  - [[#exec-path-from-shell][Exec path from shell]]
  - [[#languages][Languages]]
  - [[#ligatures][Ligatures]]
  - [[#magit][Magit]]
  - [[#modeline][Modeline]]
  - [[#org-mode-1][Org mode]]
  - [[#pyvenv][Pyvenv]]
  - [[#rainbow-mode][Rainbow mode]]
  - [[#sqlite][Sqlite]]
  - [[#sudo-edit][Sudo edit]]
  - [[#yasnippets][Yasnippets]]
  - [[#which-key][Which-key]]
- [[#keybinds][Keybinds]]
  - [[#compile][Compile]]
  - [[#important-files][Important files]]
  - [[#reloading][Reloading]]
- [[#functions][Functions]]
  - [[#async-shell][Async shell]]
  - [[#common-lisp][Common lisp]]
  - [[#movies][Movies]]

* Packages managed by debian
- Marginalia
- PDF Tools  
- Yasnippets
- Pyvenv
- Magit
- Which key
  
* Priorities
** Melpa
#+begin_src emacs-lisp
(use-package package
  :config (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t))
#+end_src

** Completion
#+begin_src emacs-lisp
(use-package icomplete
  :init (fido-vertical-mode)
  :bind (:map icomplete-minibuffer-map ("TAB" . 'icomplete-force-complete))
  :hook (icomplete-minibuffer-setup . (lambda () (setq truncate-lines t))))
(use-package savehist :init (savehist-mode))
(use-package marginalia
  :ensure t
  :init (marginalia-mode))
#+end_src

* Configs
** Autopairs
#+begin_src emacs-lisp
(electric-pair-mode 1)
(setq electric-pair-inhibit-predicate
      `(lambda (c)
         (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))
#+end_src

** Fonts
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(font . "FiraCode Nerd Font"))
(setq-default line-spacing 0.12)
#+end_src
*** Lambda
#+begin_src emacs-lisp
(defun sm-greek-lambda ()
    (font-lock-add-keywords nil `(("\\<lambda\\>"
        (0 (progn (compose-region (match-beginning 0) (match-end 0)
        ,(make-char 'greek-iso8859-7 107)) nil))))))

(add-hook 'prog-mode-hook 'sm-greek-lambda)
(add-hook 'org-mode-hook 'sm-greek-lambda)
#+end_src

** Files
#+begin_src emacs-lisp
(setq create-lockfiles nil)
(setq backup-directory-alist
      `(("." . ,(concat user-emacs-directory "backups"))))
#+end_src

** GUI
*** Colorscheme
#+begin_src emacs-lisp
(use-package catppuccin-theme
  :ensure t
  :custom (catppuccin-flavor 'mocha)
  :init (load-theme 'catppuccin :noconfirm))
#+end_src

*** Numbers
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
#+end_src

*** Menus
#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

*** Smooth scrolling
#+begin_src emacs-lisp
(pixel-scroll-precision-mode 1)
(pixel-scroll-mode 1)
(setq scroll-step            1
      scroll-conservatively  10000
      scroll-margin 8)
#+end_src

*** Tab
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
(setq indent-line-function 'insert-tab)
#+end_src

*** Transparency
#+begin_src emacs-lisp
(set-frame-parameter nil 'alpha-background 90)
(add-to-list 'default-frame-alist '(alpha-background . 90))
#+end_src

*** Truncate lines
#+begin_src emacs-lisp
(setq-default truncate-lines t)
#+end_src

*** Popups
#+begin_src emacs-lisp
(setq use-dialog-box nil)
(setq initial-scratch-message "")
#+end_src

*** Y or N
#+begin_src emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src

** Org mode
*** Defaults
#+begin_src emacs-lisp
(require 'org-tempo)
(electric-indent-mode 1)
(setq org-src-preserve-indentation t)
(setq org-startup-with-inline-images t)
#+end_src

*** Headers
#+begin_src emacs-lisp
(defun headers ()
  (custom-set-faces
   '(org-document-title ((t (:inherit default :font "Arimo Nerd Font" :weight bold :height 1.5))))
   '(org-level-1 ((t (:inherit outline-1 :font "Arimo Nerd Font" :weight bold :height 1.5))))
   '(org-level-2 ((t (:inherit outline-2 :font "Arimo Nerd Font" :weight bold :height 1.4))))
   '(org-level-3 ((t (:inherit outline-3 :font "Arimo Nerd Font" :weight bold :height 1.3))))
   '(org-level-4 ((t (:inherit outline-4 :font "Arimo Nerd Font" :weight bold :height 1.2))))
   '(org-level-5 ((t (:inherit outline-5 :font "Arimo Nerd Font" :weight bold :height 1.1))))
   '(org-level-6 ((t (:inherit outline-6 :font "Arimo Nerd Font" :weight bold :height 1.1))))
   '(org-level-7 ((t (:inherit outline-7 :font "Arimo Nerd Font" :weight bold :height 1.1))))))

(add-hook 'org-mode-hook 'headers)
#+end_src


** Reload emacs
*** Function
#+begin_src emacs-lisp
(defun reload-init-file ()
  (interactive)
  (load-file user-init-file))
#+end_src

* Packages
** All the icons
#+begin_src emacs-lisp
(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))

(use-package all-the-icons-dired
  :ensure t
  :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))
#+end_src

** Apheleia
#+begin_src emacs-lisp
(use-package apheleia
  :ensure t
  :init (apheleia-global-mode +1))
#+end_src

** Avy
#+begin_src emacs-lisp
(use-package avy
  :ensure t
  :config (avy-setup-default)
  :bind
  ("C-:" . 'avy-goto-char)
  ("M-j" . 'avy-goto-char-timer)
  ("C-'" . 'avy-goto-char-2)
  ("M-g f" . 'avy-goto-line)
  ("M-g w" . 'avy-goto-word-1)
  ("M-g e" . 'avy-goto-word-0)
  ("C-c C-j" . 'avy-resume))
#+end_src

** Corfu
#+begin_src emacs-lisp
(use-package corfu
  :ensure t
  :custom (corfu-auto t)
  :init (global-corfu-mode))
#+end_src

** Eshell
*** Alias
#+begin_src emacs-lisp
(use-package eshell
  :config
  (defalias 'g 'magit)
  (defalias 'd 'dired)
  (defalias 'f 'find-file)
  (defalias 'gl 'magit-log)
  (defalias 'clear 'eshell/clear-scrollback)
  (defalias 'l (lambda () (eshell/ls '-la))))
#+end_src
*** Prompt
#+begin_src emacs-lisp
(setq eshell-banner-message "")
(defun shortened-path (path max-len)
  "Return a modified version of `path', replacing some components
  with single characters starting from the left to try and get
  the path down to `max-len'"
  (let* ((components (split-string (abbreviate-file-name path) "/"))
         (len (+ (1- (length components))
              (cl-reduce '+ components :key 'length)))
         (str ""))
    (while (and (> len max-len)
                (cdr components))
      (setq str (concat str (if (= 0 (length (car components)))
                                "/"
                              (string (elt (car components) 0) ?/)))
            len (- len (1- (length (car components))))
            components (cdr components)))
    (concat str (cl-reduce (lambda (a b) (concat a "/" b)) components))))

(setq eshell-prompt-function (lambda nil (concat "λ "
       (shortened-path (eshell/pwd) 40)
              (if (= (user-uid) 0) " # " " $ "))))
#+end_src

** Exec path from shell
#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :ensure t
  :init
  (exec-path-from-shell-initialize))
#+end_src

** Languages
*** Common lisp
#+begin_src emacs-lisp
(use-package sly
  :ensure t
  :custom
  (inferior-lisp-program "ros -Q run")
  (split-width-threshold 0)
  (split-height-threshold nil))
#+end_src

*** Modes
#+begin_src emacs-lisp
(use-package jtsx :ensure t)
(use-package web-mode :ensure t)
(use-package lua-mode :ensure t)
(use-package php-mode :ensure t)
(use-package emmet-mode
  :ensure t
  :hook web-mode tsx-ts-mode js-mode)
(use-package treesit-auto
  :ensure t
  :config
  (global-treesit-auto-mode))
#+end_src

** Ligatures
#+begin_src emacs-lisp
(use-package ligature
  :ensure t
  :config  
  (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                       ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                       "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                       "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                       "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                       "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                       "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                       "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                       ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                       "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                       "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                       "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                       "\\\\" "://"))
  :init
  (global-ligature-mode t))
#+end_src

** Magit
#+begin_src emacs-lisp
(use-package magit
  :ensure t
  :custom (magit-display-buffer-function #'magit-display-buffer-fullframe-status-v1)
  :config (advice-add #'project-vc-dir :override #'magit))
#+end_src

** Modeline
#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))
#+end_src

** Org mode
*** Auto tangle
#+begin_src emacs-lisp
(use-package org-auto-tangle
  :ensure t
  :defer t
  :hook (org-mode . org-auto-tangle-mode))
#+end_src

*** Table of contents
#+begin_src emacs-lisp
(use-package toc-org
  :ensure t
  :commands toc-org-enable
  :hook (org-mode . toc-org-enable))
#+end_src

*** Modern
#+begin_src emacs-lisp
(use-package org-modern
  :ensure t
  :init (global-org-modern-mode)
  :custom (org-modern-star 'replace))
#+end_src

** Pyvenv
#+begin_src emacs-lisp
(use-package pyvenv :ensure t)
#+end_src

** Rainbow mode
*** Rainbow
#+begin_src emacs-lisp
(use-package rainbow-mode
  :ensure t
  :hook org-mode prog-mode)
#+end_src

*** Delimiters
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :hook prog-mode org-mode)
#+end_src

** Sqlite
#+begin_src emacs-lisp
(use-package sqlite-mode-extras
  :ensure t
  :bind (:map sqlite-mode-map
         ("n" . next-line)
         ("p" . previous-line)
         ("<backtab>" . sqlite-mode-extras-backtab-dwim)
         ("<tab>" . sqlite-mode-extras-tab-dwim)
         ("RET" . sqlite-mode-extras-ret-dwim)))

#+end_src

** Sudo edit
#+begin_src emacs-lisp
(use-package sudo-edit :ensure t)
#+end_src


** Yasnippets
#+begin_src emacs-lisp
(use-package yasnippet :ensure t)
(use-package yasnippet-snippets
  :ensure t
  :after yasnippet
  :config (yas-global-mode t)
  :custom (yas-snippets-dirs '("~/.config/emacs/elpaca/builds/yasnippet-snippets/")))
#+end_src

** Which-key
#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :init (which-key-mode))
#+end_src

* Keybinds
** Compile
#+begin_src emacs-lisp
(keymap-global-set "C-c c c" 'compile)
(keymap-global-set "C-c c r" 'recompile)
#+end_src

** Important files
*** Config files
#+begin_src emacs-lisp
(keymap-global-set "C-c o c" '(lambda () (interactive) (find-file "~/dots/.config/emacs/config.org")))
(keymap-global-set "C-c o s" '(lambda () (interactive) (find-file "~/dots/.config/sway/README.org")))
(which-key-add-key-based-replacements
  "C-c o c" "Open Emacs Config"
  "C-c o s" "Open Sway Config")
#+end_src

*** Agenda
#+begin_src emacs-lisp
(keymap-global-set "C-c f a" '(lambda () (interactive) (find-file "~/Agenda/Agenda.org")))
(keymap-global-set "C-c f e" '(lambda () (interactive) (find-file "~/Agenda/elfeed.org")))
(keymap-global-set "C-c a" 'org-agenda)
(which-key-add-key-based-replacements
  "C-c f a" "Open Agenda"
  "C-c f e" "Open Elfeed Feeds")
#+end_src

** Reloading
#+begin_src emacs-lisp
(keymap-global-set "C-c r r" 'reload-init-file)
#+end_src

* Functions
** Async shell
#+begin_src emacs-lisp
(defun async-shell-command-no-window (command)
  (interactive)
  (let ((display-buffer-alist
        (list
         (cons
          "\\*Async Shell Command\\*.*"
          (cons #'display-buffer-no-window nil)))))
    (async-shell-command
     command)))
#+end_src

** Common lisp
#+begin_src emacs-lisp
(defun lisp-script ()
  "Start a Roswell script"
  (interactive)
  (let ((script-name (read-string "Script name: ")))
    (shell-command (format "ros init %s" script-name))))
#+end_src

** Movies
#+begin_src emacs-lisp
(setq video-player "swayhide mpv ")

(defun scream ()
  "Play the Scream movie"
  (interactive)
  (async-shell-command-no-window
   (concat video-player
	   (shell-quote-argument
	    (expand-file-name "~/mov/Scream (1996)/")))))

(defun watch-movie ()
  "Select a movie to watch"
  (interactive)
  (let* ((movies (directory-files "~/mov/"))
	 (movie (completing-read "Movie: " (cddr movies)))
	 (path (shell-quote-argument (expand-file-name (concat "~/Movies/" movie)))))
    (async-shell-command-no-window
     (concat video-player path))))
#+end_src
